thisdev/bitBlockfinder/sdkconfig.defaults
# --- Board: Waveshare ESP32-S3-Touch-AMOLED-1.8 (ESP32-S3R8, 16 MB Flash) ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 8 MB embedded PSRAM des ESP32-S3R8 -> oktal. Ohne das kein LVGL.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_FREERTOS_HZ=1000

# Die Oberflaeche benutzt ausschliesslich die selbst uebersetzte Comic Sans
# aus main/schrift/. Von Montserrat bleibt nur die 14er, weil LVGL sie als
# Vorgabeschrift braucht -- die grossen Groessen waeren totes Gewicht.

# app_main baut die Oberflaeche auf und holt danach HTTPS-Antworten.
# Die Standardgroesse ist dafuer zu knapp.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# mempool.space spricht ausschliesslich HTTPS. Das mitgelieferte
# Wurzelzertifikat-Bundle erspart es, einzelne Zertifikate zu pflegen --
# die wuerden sonst irgendwann ablaufen und das Geraet stumm schalten.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Erlaubt Bildschirmaufnahmen fuer die Dokumentation
CONFIG_LV_USE_SNAPSHOT=y

# --- Zeichenpuffer und TLS muessen sich denselben internen Speicher teilen ---
#
# Das BSP legt den LVGL-Zeichenpuffer ohne DMA-Kennzeichnung an. Der
# SPI-Treiber muss deshalb vor jeder Uebertragung eine Kopie in
# DMA-faehigem internem RAM anlegen -- bei der Vorgabe von 100 Zeilen sind
# das 368*100*2 = 72 KB am Stueck. Solange nur gezeichnet wird, geht das
# gut. Nach mehreren TLS-Verbindungen ist der interne Heap aber
# zerstueckelt, der Block ist nicht mehr zusammenhaengend zu bekommen, und
# das Display bleibt stehen:
#
#   E spi_master: setup_dma_priv_buffer: Failed to allocate priv TX buffer
#   E co5300_spi: panel_co5300_draw_bitmap: send color data failed
#
# Dieses Geraet holt beim Start sieben Antworten hintereinander. Zwei
# Stellschrauben dagegen, beide noetig: ein kleinerer Zeichenpuffer (40
# Zeilen sind rund 29 KB und auch in einem zerstueckelten Heap zu finden),
# und mbedTLS gibt seine Puffer zwischen den Verbindungen wieder frei.
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=40
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
